In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:koushik16@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%%sql
show databases

 * mysql+mysqlconnector://root:***@localhost/
9 rows affected.

[('de_project',),
 ('dt_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('uber',),
 ('world',)]

In [4]:
%%sql
create database zomato;
use zomato;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
0 rows affected.

[]

In [16]:
%%sql
use zomato;
DROP TABLE  Restaurants;
CREATE TABLE Restaurants (
    id INT  PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    location VARCHAR(100) NOT NULL
);

INSERT INTO Restaurants (id, name, location) VALUES
(1, 'ABC Bistro', 'New York'),
(2, 'The Foodie', 'Los Angeles'),
(3, 'Tasty Treat', 'Chicago');
DROP TABLE  Orders;
CREATE TABLE Orders (
    order_id INT PRIMARY KEY,
    restaurant_id INT NOT NULL,
    order_date DATE NOT NULL
);

INSERT INTO Orders (order_id,restaurant_id, order_date) VALUES
(1, 1, '2023-01-01'),
(2, 1, '2023-01-02'),
(3, 2, '2023-01-05'),
(4, 4, '2023-01-07');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
3 rows affected.
0 rows affected.
0 rows affected.
4 rows affected.

[]

In [ ]:
select * from R

In [18]:
%%sql
select 
r.name as restaurant_name,
o.order_date 
from Restaurants r
join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5))]

In [21]:
%%sql
###LEFT JOIN
select 
r.name as restaurant_name,
o.order_date 
from Restaurants r
left join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 2)),
 ('ABC Bistro', datetime.date(2023, 1, 1)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('Tasty Treat', None)]

In [ ]:
%%sql
select 
r.name as restaurant_name,
o.order_date 
from Restaurants r
right join orders o on r.id = o.restaurant_id